_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 4)                 0         
_________________________________________________________________
dense_1 (Dense)              (None, 18)                90        
_________________________________________________________________
activation_1 (Activation)    (None, 18)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 18)                342       
_________________________________________________________________
activation_2 (Activation)    (None, 18)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 19        
=================================================================
Total params: 451
Trainable params: 451
Non-trainable params: 0
_________________________________________________________________
